{
  "id": "ValueSet-expand",
  "url": "http://hl7.org/fhir/OperationDefinition/ValueSet-expand",
  "code": "expand",
  "date": "2023-03-26T15:21:02+11:00",
  "kind": "operation",
  "name": "Expand",
  "type": true,
  "title": "Value Set Expansion",
  "status": "active",
  "system": false,
  "comment": "The value set expansion returned by this query should be treated as a transient result that will change over time (whether it does or not depends on how the value set is specified), so applications should repeat the operation each time the value set is used.  \n\nWhen available, ValueSet.status and ValueSet.version from the ValueSet resource instance which contains the definition SHALL be persisted to the ValueSet resource instance which contains the expansion.   \n\nIf the expansion is too large (at the discretion of the server), the server MAY return an error (OperationOutcome with code too-costly). Clients can work through large flat expansions in a set of pages (partial views of the full expansion) instead of just getting the full expansion in a single exchange by using offset and count parameters, or use the count parameter to request a subset of the expansion for limited purposes. Servers are not obliged to support paging, but if they do, SHALL support both the offset and count parameters. Hierarchical expansions are not subject to paging and servers simply return the entire expansion.  \n\nDifferent servers may return different results from expanding a value set for the following reasons:  \n\n* The underlying code systems are different (e.g. different versions, possibly with different defined behavior) \n* The server optimizes filter includes differently, such as sorting by code frequency \n* Servers introduce arbitrary groups to assist a user to navigate the lists based either on extensions in the definition, or additional knowledge available to the server\n\nWhen a server cannot correctly expand a value set because it does not fully understand the code systems (e.g. it has the wrong version, or incomplete definitions) then it SHALL return an error. If the value set itself is unbounded due to the inclusion of post-coordinated value sets (e.g. SNOMED CT, UCUM), then the extension [http://hl7.org/fhir/StructureDefinition/valueset-unclosed](http://hl7.org/fhir/extensions/StructureDefinition-valueset-unclosed.html) can be used to indicate that the expansion is incomplete",
  "version": "5.0.0",
  "instance": true,
  "resource": [
    "ValueSet"
  ],
  "parameter": [
    {
      "max": "1",
      "min": 1,
      "use": "in",
      "name": "url",
      "type": "uri",
      "documentation": "A canonical reference to a value set. The server must know the value set (e.g. it is defined explicitly in the server's value sets, or it is defined implicitly by some code system known to the server",
      "scope" : ["type"]
    },
    {
      "max": "1",
      "min": 0,
      "use": "in",
      "name": "valueSetVersion",
      "type": "string",
      "documentation": "The identifier that is used to identify a specific version of the value set to be used when generating the expansion. This is an arbitrary value managed by the value set author and is not expected to be globally unique. For example, it might be a timestamp (e.g. yyyymmdd) if a managed version is not available.",
      "scope" : ["type"]
    }
  ],
  "publisher": "HL7 (FHIR Project)",
  "description": "The definition of a value set is used to create a simple collection of codes suitable for use for data entry or validation. \n\nIf the operation is not called at the instance level, one of the in parameters url, context or valueSet must be provided.  An expanded value set will be returned, or an OperationOutcome with an error message.",
  "affectsState": false,
  "experimental": false,
  "resourceType": "OperationDefinition"
}
